In [1]:
import pandas as pd
import os
import re

In [2]:
listfiles = os.listdir('D:/Python/Python_course/Data analysis/JupiterNotebookfolder/names')
result_list = []
pattern = re.compile(r'\d+')
for number, file in enumerate(listfiles):
    year = pattern.findall(file)
    path = f'D:/Python/Python_course/Data analysis/JupiterNotebookfolder/names/{file}'
    name = f'my_df{number}'
    x = name
    x = pd.read_csv(path, names=['Name', 'Gender','Quantity'])
    x['Year'] = year[0]
    result_list.append(x)
my_df = pd.concat(result_list)
my_df

            Name Gender  Quantity  Year
0           Mary      F      7065  1880
1           Anna      F      2604  1880
2           Emma      F      2003  1880
3      Elizabeth      F      1939  1880
4         Minnie      F      1746  1880
...          ...    ...       ...   ...
32028      Zylas      M         5  2018
32029      Zyran      M         5  2018
32030      Zyrie      M         5  2018
32031      Zyron      M         5  2018
32032      Zzyzx      M         5  2018

[1957046 rows x 4 columns]

In [64]:
def count_top3(years_list):
    selected_years_list = []
    for year in years_list:
        result = my_df[my_df['Year'] == str(year)]
        selected_years_list.append(result)
    union_years = pd.concat(selected_years_list)
    x = union_years.groupby(['Name']).sum().sort_values('Quantity', ascending=False)
    return x.head(3).index.tolist()

In [65]:
count_top3([1900, 1950, 2000])

['James', 'John', 'Robert']

In [ ]:
def count_dynamics(years_list):
    selected_years_list = []
    result_list = []
    for year in years_list:
        result = my_df[my_df['Year'] == str(year)]
        x = result.groupby(['Gender']).sum()
        result_list.append(x)
    d = pd.concat(result_list)
    return d

In [48]:
count_dynamics([1900, 1950, 2000])

        Quantity
Gender
F         299798
M         150480
F        1713065
M        1790437
F        1815295
M        1963202